natecheadle/CMakeNucleoExample/CPP_HAL/Serial/USART/STM32/STM32_AsynchronousUSART.h
#pragma once

#include "Serial/USART/AsynchronousUSART.h"

#include <stm32f3xx_hal.h>
#include "GPIO/Pins/DIO_Pin.h"
#include "GPIO/Pins/STM32_Pin.h"

#include <Container/StaticQueue.hpp>

namespace CPP_HAL {

    class STM32_AsynchronousUSART : public AsynchronousUSART<STM32_AsynchronousUSART> {
        friend AsynchronousUSART;
    public:
        STM32_AsynchronousUSART(
                DIO_Pin<STM32_Pin> rxPin,
                DIO_Pin<STM32_Pin> txPin,
                BaudRate baudRate,
                WordLength wordLength,
                StopBits stopBits,
                Parity parity,
                Mode mode,
                FlowControlMode flowControlMode,
                OverSampling overSampling);

        ~STM32_AsynchronousUSART();

    protected:
        virtual GPIO_InitTypeDef populateGPIOStruct(const DIO_Pin<STM32_Pin> &pin) const;

        virtual UART_HandleTypeDef populateUARTStruct() const;

        void do_sendBytes(const uint8_t *pData, size_t size, const std::function<void()>& f_OnComplete) final;

        void do_receiveBytes(uint8_t *pData, size_t size, const std::function<void()>& f_OnComplete) final;

    private:
        void OnTransmissionComplete();

        static USART_TypeDef *GetUSARTInstance(Pin_ID rxPin, Pin_ID txPin);

        UART_HandleTypeDef m_HUART;
        const DIO_Pin<STM32_Pin> m_RxPin;
        const DIO_Pin<STM32_Pin> m_TxPin;
    };
}
